INSERT INTO genres(title)
VALUES ('pop'),
	('rock'),
	('chanson'),
	('folk'),
	('hip hop')
;

INSERT INTO executors (nickname)
VALUES ('Руки вверх'),
	('Максим'),
	('Кино'),
	('Сплин'),
	('Михаил Круг'),
	('Елена Ваенга'),
	('Надежда Кадышева'),
	('Баста')
;

INSERT INTO albums  (title, year_of_release)
VALUES ('Сделай погромче', 1998),
	('Трудный возраст', 2006),
	('Черный альбом', 1990),
	('Гранатовый альбом', 1998),
	('Владимирский централ', 1999),
	('The best', 2014),
	('Когда нибудь', 2004),
	('К тебе', 2008)
;
	
INSERT INTO tracks  (title, duration, album_id)
VALUES ('Крошка моя', 250, 1),
	('Чужие губы', 277, 1),
	('Сон', 203, 2),
	('Отпускаю', 261, 2),
	('Нам с тобой', 289, 3),
	('Кукушка', 400, 3),
	('Орбит без сахара', 137, 4),
	('Выхода нет', 227, 4),
	('Мадам', 256, 5),
	('Владимирский централ', 268, 5),
	('Клавиши', 186, 6),
	('Абсент', 202, 6),
	('Ничего не получится', 184, 7),
	('Старенькая церквушка', 232, 7),
	('Чувства', 226, 8),
	('Мама', 236, 8),
	('Так плачет весна', 230, 8)
;
	
INSERT INTO collection  (title, year_of_release)
VALUES ('Сборник 1', 1998),
	('Сборник 2', 2014),
	('Сборник 3', 2015),
	('Сборник 4', 2016),
	('Сборник 5', 2018),
	('Сборник 6', 2019),
	('Сборник 7', 2020),
	('Сборник 8', 2021)
;
	
INSERT INTO executors_genres  (executor_id, genre_id)
VALUES (1, 1),
	(2, 1),
	(3, 2),
	(4, 2),
	(5, 3),
	(6, 3),
	(7, 4),
	(8, 5)
;

INSERT INTO executors_albums  (album_id, executor_id)
VALUES (1, 1),
	(2, 2),
	(3, 3),
	(4, 4),
	(5, 5),
	(6, 6),
	(7, 7),
	(8, 8)
;
	
INSERT INTO collections_tracks  (tracks_id, collection_id)
VALUES (1, 1),
	(3, 2),
	(5, 3),
	(7, 4),
	(9, 5),
	(11, 6),
	(13, 7),
	(15, 8)
;
	